tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"

# brew "awscli"
brew "ccat"
brew "curl"
brew "diff-so-fancy"
brew "exa"
brew "git"
brew "git-flow"
brew "git-flow"
brew "htop"
brew "htop"
brew "imagemagick"
brew "jq"
brew "jupyter"
brew "kong"
brew "macvim"
brew "mongodb"
brew "moreutils"
brew "mtr"

    # allow mtr to run without sudo
    mtrlocation=$(brew info mtr | grep Cellar | sed -e 's/ (.*//') #  e.g. `/Users/paulirish/.homebrew/Cellar/mtr/0.86`
    sudo chmod 4755 $mtrlocation/sbin/mtr
    sudo chown root $mtrlocation/sbin/mtr

brew "nginx"
brew "nvm"
brew "ncdu"
brew "redis"
brew "rsync"
brew "tldr"
brew "tmux"
brew "the_silver_searcher"
brew "tldr"
brew "tree"
# brew "vim"
brew "httpie"

cask "authy"
cask "charles"
cask "docker"
cask "iterm2"
cask "slack"
cask "visual-studio-code"
cask "wget"
cask "inkscape"
cask "tableplus"
cask "itsycal"
cask "sensiblesidebuttons"
cask "firefox"
cask "pritunl"
cask "ndm"
cask "meld"
cask "scroll-reverser"
cask "java"

mas "Monosnap", id: 540348655

